In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name":['Harry','rohan','skilldf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','kolkata','bareilly','antartica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks       city
0    Harry     92     rampur
1    rohan     34    kolkata
2  skilldf     24   bareilly
3    shubh     17  antartica

In [5]:
df.to_csv("dict1.csv")

In [6]:
df.to_csv("dict1_index_false.csv",index=False)

In [7]:
df.head(2)

    name  marks     city
0  Harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

      name  marks       city
2  skilldf     24   bareilly
3    shubh     17  antartica

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
train=pd.read_csv('train.csv')

In [11]:
train

   Train no2  Speed2      city2
0      12332      50     rampur
1       1234      34    kolkata
2     125654      24   bareilly
3      56453      17  antartica

In [12]:
# train['Speed'][0]=50

In [13]:
train

   Train no2  Speed2      city2
0      12332      50     rampur
1       1234      34    kolkata
2     125654      24   bareilly
3      56453      17  antartica

In [14]:
train.to_csv('train.csv')

In [15]:
train.index=['first','second','third','fourth']

In [16]:
train

        Train no2  Speed2      city2
first       12332      50     rampur
second       1234      34    kolkata
third      125654      24   bareilly
fourth      56453      17  antartica

In [17]:
ser = pd.Series(np.random.rand(32))

In [18]:
ser

0     0.356828
1     0.641693
2     0.167857
3     0.462749
4     0.898693
5     0.374195
6     0.469101
7     0.641303
8     0.035873
9     0.926088
10    0.912306
11    0.293083
12    0.337157
13    0.810422
14    0.257552
15    0.913633
16    0.578185
17    0.008227
18    0.403516
19    0.750611
20    0.429878
21    0.590172
22    0.339516
23    0.353963
24    0.892610
25    0.678238
26    0.300109
27    0.716770
28    0.631858
29    0.170236
30    0.267920
31    0.419091
dtype: float64

In [19]:
ser[31]

0.41909107965900183

In [20]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [21]:
newdf.head()

          0         1         2         3         4
0  0.085754  0.932020  0.646179  0.151600  0.746533
1  0.205349  0.933184  0.869508  0.529538  0.380353
2  0.774280  0.776519  0.679166  0.681100  0.979347
3  0.211965  0.470820  0.967389  0.922481  0.850861
4  0.441868  0.431195  0.686693  0.483623  0.585538

In [37]:
newdf

            0         1         2         3         4   5
0         0.3  0.932020  0.646179  0.151600  0.746533  25
1    0.205349  0.933184  0.869508  0.529538  0.380353  93
2     0.77428  0.776519  0.679166  0.681100  0.979347  59
3    0.211965  0.470820  0.967389  0.922481  0.850861  64
4    0.441868  0.431195  0.686693  0.483623  0.585538   9
..        ...       ...       ...       ...       ...  ..
329  0.458612  0.019907  0.219379  0.266624  0.027880  12
330  0.015787  0.162353  0.998286  0.227778  0.872603  98
331  0.772139  0.401662  0.935508  0.098401  0.753060  96
332  0.182836  0.942822  0.866652  0.673829  0.814392  79
333   0.09512  0.232116  0.897382  0.812279  0.087234  77

[334 rows x 6 columns]

In [36]:
newdf['5']=np.random.randint(1,100,size=334)

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
type(newdf[1])

pandas.core.series.Series

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.504632    0.502289    0.502385    0.509815    0.486134
std      0.289712    0.300659    0.287942    0.296058    0.305335
min      0.000341    0.005152    0.003928    0.003080    0.003756
25%      0.244991    0.236843    0.258702    0.257578    0.204649
50%      0.508741    0.495165    0.489919    0.521463    0.468532
75%      0.763452    0.754257    0.759954    0.754529    0.776924
max      0.992432    0.998542    0.998286    0.997926    0.998279

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
newdf[0][0]="Harry"

In [29]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [30]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [31]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [32]:
newdf.to_numpy()

array([['Harry', 0.9320197579235399, 0.6461794221603597,
        0.1516004467603862, 0.7465329699313787],
       [0.20534857843795984, 0.9331836254390293, 0.8695082574727067,
        0.5295379760433855, 0.38035335842650864],
       [0.774280180896581, 0.7765188114511113, 0.6791663622797026,
        0.6810998683387, 0.9793465868826305],
       ...,
       [0.7721387504290408, 0.4016622711899137, 0.9355081563132605,
        0.09840149791520203, 0.7530596412396984],
       [0.18283635932626763, 0.9428215184268289, 0.8666522887303509,
        0.6738291553663143, 0.8143920975410676],
       [0.09511987502194197, 0.23211614449768925, 0.8973824234767163,
        0.812279352647655, 0.08723433745515596]], dtype=object)

In [33]:
newdf[0][0]=0.3

In [34]:
newdf.head()

          0         1         2         3         4
0       0.3  0.932020  0.646179  0.151600  0.746533
1  0.205349  0.933184  0.869508  0.529538  0.380353
2   0.77428  0.776519  0.679166  0.681100  0.979347
3  0.211965  0.470820  0.967389  0.922481  0.850861
4  0.441868  0.431195  0.686693  0.483623  0.585538

In [40]:
newdf[2]+newdf[3]+newdf[4]

0      1.544313
1      1.779400
2      2.339613
3      2.740732
4      1.755854
         ...
329    0.513884
330    2.098668
331    1.786969
332    2.354874
333    1.796896
Length: 334, dtype: float64

In [41]:
newdf['average']=newdf[2]+newdf[3]+newdf[4]

In [44]:
newdf.round(2)

            0     1     2     3     4   5  average
0         0.3  0.93  0.65  0.15  0.75  25     1.54
1    0.205349  0.93  0.87  0.53  0.38  93     1.78
2     0.77428  0.78  0.68  0.68  0.98  59     2.34
3    0.211965  0.47  0.97  0.92  0.85  64     2.74
4    0.441868  0.43  0.69  0.48  0.59   9     1.76
..        ...   ...   ...   ...   ...  ..      ...
329  0.458612  0.02  0.22  0.27  0.03  12     0.51
330  0.015787  0.16  1.00  0.23  0.87  98     2.10
331  0.772139  0.40  0.94  0.10  0.75  96     1.79
332  0.182836  0.94  0.87  0.67  0.81  79     2.35
333   0.09512  0.23  0.90  0.81  0.09  77     1.80

[334 rows x 7 columns]

In [ ]:
newdf.T

In [ ]:
newdf.sort_index(axis=0,ascending=False)

In [ ]:
newdf[0]

In [ ]:
newdf.head()

In [ ]:
newdf2=newdf #it just a view that will points newdf ,if we change anything in newdf2 ,it will be change in newdf

In [ ]:
newdf2[0][0]=9783

In [ ]:
newdf.head()

In [ ]:
newdf3=newdf.copy()

In [ ]:
newdf3[0][0]=575

In [ ]:
newdf

In [ ]:
newdf3

In [ ]:
newdf.loc[0,0]=654

In [ ]:
newdf.head(2)

In [ ]:
newdf.columns=list("ABCDE")

In [ ]:
newdf.loc[0,'A']=729

In [ ]:
newdf=newdf.drop(0,axis=1)

In [ ]:
newdf.head()

In [ ]:
newdf.loc[[1,2],['C','D']]

In [ ]:
newdf.loc[:,['C','D']]

In [ ]:
newdf.loc[[1,2],:]

In [ ]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

In [ ]:
newdf.head()

In [ ]:
newdf.iloc[0,4]

In [ ]:
newdf.iloc[[0,5],[1,2]]

In [ ]:
newdf.head(3)

In [ ]:
newdf.drop(['A','C'],axis=1)

In [ ]:
newdf.drop(['A','D'],axis=1,inplace=True)    #this will make change in original newdf

In [ ]:
newdf

In [ ]:
newdf.drop([1,5],axis=0,inplace=True)

In [ ]:
newdf.head()

In [ ]:
newdf.reset_index(drop=True,inplace=True)

In [ ]:
newdf

In [ ]:
newdf['B'].isnull()

In [ ]:
newdf['B']=None

In [ ]:
newdf

In [ ]:
newdf.loc[:,'B']=None

In [ ]:
newdf.head()

In [ ]:
df =pd.DataFrame({'Name': ['Lisa', 'Meghna', 'David', 'Lisa'], 'ID': [1, 2, 3, 4], 'Salary': [np.nan, np.nan, np.nan, pd.NaT],
      'Role': ['CEO', None, pd.NaT, pd.NaT]})

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
df

In [ ]:
df.dropna(how='all',axis=1)

In [ ]:
df.drop_duplicates(subset=['Name'],keep=False)

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df.notnull()

In [ ]:
#create a dataframe which contains only integers with 3 rows and 2 columns 
#run following dataframe methods on them
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()

In [ ]:
data = pd.read_excel('data1.xlsx',sheet_name='Sheet2')

In [ ]:
data

In [ ]:
data.iloc[0,0]=34

In [ ]:
data

In [ ]:
data2=data.copy()
with pd.ExcelWriter('data1.xlsx') as writer:
    data.to_excel(writer,sheet_name='Sheet1')
    data2.to_excel(writer,sheet_name='Sheet2')

In [ ]:
data.to_excel('data1.xlsx',sheet_name='Sheet2')

In [38]:
np.random.uniform(1,100,size=100)

array([48.49474968, 72.14850247, 17.08532487, 86.59474043,  9.52674744,
       37.63955723, 44.57651596, 61.56067507,  7.5512402 , 26.2171114 ,
       93.06250827,  6.42119402, 81.66309391, 32.23479181, 76.98905058,
       37.64243214, 17.50003318, 84.97370886, 36.75394811, 46.42620254,
        3.98911762, 68.34206721, 35.95684299, 40.51925842, 61.75310329,
       65.54919477, 21.80260858, 97.41122586, 82.92127803, 14.16393266,
       78.44185876, 11.74563923, 57.06261731, 12.80237867, 59.93731026,
       15.05728504, 59.69656542, 90.28307171, 40.20034763, 39.77849661,
       74.18841393,  2.36330343, 70.49171576, 73.12480207, 48.14669855,
       25.36239425, 30.30742631, 91.73679447, 82.72580719, 19.76612671,
       58.08047145, 56.5711565 , 76.95702663, 97.24059317, 20.47972238,
       36.529292  , 11.6290958 , 74.66992597, 52.29652325, 68.93209029,
       60.87128893, 70.47275014, 69.01668467, 96.73679169, 37.40789922,
       80.9624821 ,  7.34873203, 59.4014582 , 87.50982189, 15.66267881,
       33.0682919 , 97.45076461, 59.82259032, 39.40483887, 82.43921152,
       93.71857551, 51.20373015, 43.37308171,  5.33302444, 84.51177488,
       21.91302254, 83.38516158, 76.33245855, 99.10417555, 63.87736243,
       29.39265198,  3.59320973, 51.0134215 , 40.59999464,  4.2840136 ,
       59.21069848, 22.04666758, 77.29927692, 46.39274929, 29.37597295,
       48.93205035, 22.19116644,  8.2948123 , 28.45957728, 25.22759496])